package Functions;

import Listeners.PoiMainClass;

import java.util.*;

public class TheoryTask3
{
    //////////////////////////////////////////
    //передаём объекты и создаём конструктор//
    //////////////////////////////////////////
    PoiMainClass poiMainClassVariant;
    PoiMainClass poiMainClassAnswers;
    final int font_size;

    public TheoryTask3(PoiMainClass poiMainClassVariant, PoiMainClass poiMainClassAnswers, int font_size)
    {
        this.poiMainClassVariant = poiMainClassVariant;
        this.poiMainClassAnswers = poiMainClassAnswers;
        this.font_size = font_size;
    }

    /////////////////////////////
    //для случайного числа надо//
    /////////////////////////////
    Random rand = new Random();

    public void theoryTask3Function()
    {
        ///////////////////////////////////////////////////////////////////
        //тут всё хорошо, все символы корректно отображаются (и картинки)//
        ///////////////////////////////////////////////////////////////////
        //буквы ответов, вопросы и ответы к ним//
        /////////////////////////////////////////
        String[] alphabet = {"А) ", "Б) ", "В) ", "Г) "};
        String[] theoryTask3Questions = {"Парный коэффициент корреляции r(X Y), изменяется в пределах:", "Парный коэффициент корреляции равен –1. Это означает:",
                "Вероятности появления заданного числа благоприятных исходов в схеме Бернулли описываются:", "Математического ожидания не существует у случайной величины:",
                "Закон больших чисел выводится из неравенства Чебышева при условии существования у случайной величины:", "Характеристическая функция случайной величины есть:",
                "Если характеристическая функция случайной величины имеет производную в точке нуль, то:", "Характеристическая функция нормального стандартного распределения равна:",
                "Зная характеристическую функцию можно определить функцию распределения:",
                "Определите закон распределения непрерывной случайной величины, если плотность распределения имеет вид (см. картинку):"};
        String[][] theoryTask3Answers = { {"-1 ⩽ r(X, Y) ⩽ 1", "0 ⩽ r(X, Y) ⩽ 1", "-∞ ⩽ r(X, Y) ⩽ +∞", "0 ⩽ r(X, Y) ⩽ ∞"},
                {"Отрицательную линейную связь", "Наличие нелинейной функциональной связи", "Отсутствие связи", "Положительную линейную связь"},
                {"Биноминальным распределением", "Геометрическим распределением", "Равномерным распределением на отрезке", "Однородным распределением"},
                {"Распределенной по Коши", "Равномерно распределенной на отрезке", "Имеющей нормальное распределение", "Неравномерно распределенной на отрезке"},
                {"Конечного второго момента", "Конечного математического ожидания", "Плотности", "Дисперсии"},
                {"Комплекснозначная функция действительного переменного", "Аналитическая функция комплексного переменного", "Действительная функция комплексного переменного", "Мнимая функция комплексного переменного"},
                {"Случайная величина имеет конечное математическое ожидание", "Случайная величина имеет плотность", "Случайная величина имеет конечный момент второго порядка", "Все варианты неверные"},
                {"e^(-r²/2)", "e^(it)", "1", "1 - e^(it)"}, {"Произвольной случайной величины", "Непрерывной случайной величины", "Простой случайной величины", "Невозможно определить функцию распределения"},
                {"Равномерное распределение", "Экспоненциальное распределение", "Нормальное распределение", "Биномиальное распределение"} };
        /////////////////////////////////////////////////////
        //делаем рандомное число - номер вопроса из массива//
        /////////////////////////////////////////////////////
        int number = rand.nextInt(0, 10);
        ///////////////////////////////////
        //записываем вопрос после отступа//
        ///////////////////////////////////
        poiMainClassVariant.newParagraph();
        poiMainClassVariant.newParagraph();
        poiMainClassVariant.addText("3. " + theoryTask3Questions[number]);
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //танцы с бубном ака шафл(перемешивание) массива ответов: делаем массив, в него их передаём, переводим его в лист, шаффлим лист, переводим обратно в массив (как допёр - сам не знаю)//
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        String[] res = {"", "", "", ""};
        for (int i = 0; i < 4; i++)
            res[i] = theoryTask3Answers[number][i];
        List<String> res2 = Arrays.asList(res);
        Collections.shuffle(res2);
        String[] res3 = {"", "", "", ""};
        for (int i = 0; i < 4; i++)
            res3[i] = res2.get(i);
        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //тут спорное решение: я не нашёл некоторые спец. символы и сделал картинки (скриншоты), если это тот самый номер - из массива картинок подставляем нужную по массиву///////////////////////////////
        //спорное потому, что картинки не масштабируются, и норм смотрятся только с 14-20 размером шрифта, так что тут может быть проблема (если прижмёт - удалим их и будем некрасивые ответы показывать)//
        ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        if (number == 7)
        {
            String[] resImages = {"src\\dopRes\\theoryQuestion\\theoryQuestion28_a.png", "src\\dopRes\\theoryQuestion\\theoryQuestion28_b.png", "src\\dopRes\\theoryQuestion\\theoryQuestion28_c.png", "src\\dopRes\\theoryQuestion\\theoryQuestion28_d.png"};
            int[][] resSizes = { {0, 0}, {0, 0}, {0, 0}, {0, 0} };
            if (font_size == 10) { resSizes = new int[][] { {20, 20}, {10, 10}, {5, 10}, {45, 10} }; }
            if (font_size == 12) { resSizes = new int[][] { {25, 25}, {15, 15}, {8, 12}, {48, 12} }; }
            if (font_size == 14) { resSizes = new int[][] { {30, 30}, {20, 20}, {10, 15}, {50, 15} }; }
            if (font_size == 16) { resSizes = new int[][] { {35, 35}, {25, 25}, {12, 17}, {52, 28} }; }
            if (font_size == 18) { resSizes = new int[][] { {40, 40}, {30, 30}, {15, 20}, {55, 20} }; }
            for (int i = 0; i < 4; i++)
            {
                poiMainClassVariant.newParagraph();
                poiMainClassVariant.addText(alphabet[i]);
                if (res3[i] == "e^(-r²/2)")
                    poiMainClassVariant.addPicture(resImages[0], resSizes[0][0], resSizes[0][1]);
                if (res3[i] == "e^(it)")
                    poiMainClassVariant.addPicture(resImages[1], resSizes[1][0], resSizes[1][1]);
                if (res3[i] == "1")
                    poiMainClassVariant.addPicture(resImages[2], resSizes[2][0], resSizes[2][1]);
                if (res3[i] == "1 - e^(it)")
                    poiMainClassVariant.addPicture(resImages[3], resSizes[3][0], resSizes[3][1]);
                if (res3[i] == theoryTask3Answers[number][0])
                    poiMainClassAnswers.addText("№3 - " + alphabet[i] + ";");
            }
        }
        //////////////////////////////////////////////////
        //добавляем картинку в само задание, не в ответы//
        //////////////////////////////////////////////////
        else if (number == 9)
        {
            int width = 0;
            int height = 0;
            if (font_size == 10) { width = 130; height = 60;}
            if (font_size == 12) { width = 140; height = 65;}
            if (font_size == 14) { width = 150; height = 70;}
            if (font_size == 16) { width = 160; height = 75;}
            if (font_size == 18) { width = 170; height = 80;}
            poiMainClassVariant.newParagraph();
            poiMainClassVariant.addPicture("src\\dopRes\\theoryQuestion\\theoryQuestion30.png", width, height);
            for (int i = 0; i < 4; i++)
            {
                poiMainClassVariant.newParagraph();
                poiMainClassVariant.addText(alphabet[i] + res3[i]);
                if (res3[i] == theoryTask3Answers[number][0])
                    poiMainClassAnswers.addText("№3 - " + alphabet[i] + ";");
            }
        }
        else
        {
            ///////////////////////////////////////////////////////////////
            //если последняя строка - ставим точку, иначе точку с запятой//
            ///////////////////////////////////////////////////////////////
            for (int i = 0; i < 4; i++)
            {
                if (i == 3)
                {
                    poiMainClassVariant.newParagraph();
                    poiMainClassVariant.addText(alphabet[i] + res3[i] + ".");
                }
                else
                {
                    poiMainClassVariant.newParagraph();
                    poiMainClassVariant.addText(alphabet[i] + res3[i] + ";");
                }
                ////////////////////////////////////////////////////////////////////////////////////////////////////////
                //записываем букву ответа в файл ответов (хитрость в том, что ответы всегда на первом месте в массиве)//
                ////////////////////////////////////////////////////////////////////////////////////////////////////////
                if (res3[i] == theoryTask3Answers[number][0])
                    poiMainClassAnswers.addText("№3 - " + alphabet[i] + ";");
            }
        }
    }
}